Revit 2027 API
BuiltInFailures.DPartFailures.DeletingDPartWillDeleteAllPartsWarning Property
 Deleting a Part will delete all associated Parts and the original Element will be made visible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingDPartWillDeleteAllPartsWarning { get; }
Public Shared ReadOnly Property DeletingDPartWillDeleteAllPartsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingDPartWillDeleteAllPartsWarning {
	FailureDefinitionId^ get ();
}
static member DeletingDPartWillDeleteAllPartsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace